cases/05_navier_stokes_equation/17_lid_driven_cavity_piso_Re1000_hybrid80/N80/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /    O  peration     | Mesh patch construction
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createPatchDict;
}

pointSync false;
writeCyclicMatch false;

patches
{
    front
    {
        patchInfo { type empty; }
        constructFrom patches;
        patches (frontSource);
    }
    back
    {
        patchInfo { type empty; }
        constructFrom patches;
        patches (backSource);
    }
}
