cases/05_navier_stokes_equation/17_lid_driven_cavity_piso_Re1000_hybrid80/N80/constant/Vc
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Vc;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9282
(
0.000190361152949
0.000183691319057
0.000187169499679
0.000442193047047
0.000436584981269
0.000352025160232
0.000421059572699
0.000350237853504
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    leftWall
    {
        type            calculated;
        value           uniform 0;
    }
    rightWall
    {
        type            calculated;
        value           uniform 0;
    }
    movingTop
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
