cases/05_navier_stokes_equation/17_lid_driven_cavity_piso_Re1000_hybrid80/N80/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /    O  peration   |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

// 第五题方腔流的运动黏度。
//
// Reynolds 数定义为：
//
//     Re = U L / nu
//
// 这里取 U = 1, L = 1，因此：
//
//     Re = 1 / nu
nu 0.001;
